/*
Задача 2 - Щастя в грошах? (складність 2/5)

Уявимо собі що є клієнт, який має суму грошей “P” і хоч їх інвестувати, він хоче знати скільки років “Y” ця сума повинна зберігатися в банку для того щоб вона виросла до бажаної “D”.
Ця сума буде зберігатися “Y” років в банку де ставка “I” буде виплачена кожного року, і нова сума буде реінвестована з нового року після сплачування податку “T”.

Уточнення:
Початкова сума P не підлягає податку, тільки накопичення які виросли за ставкою за рік.
Бажана сума завжди буде вища ніж початковий капітал.

Приклад:
Отже ми маємо 4 змінні 
P (Капітал) = 1000;
I (Відсоткова ставка) = 0.05;
T (Податки) = 0.18
D (Бажана сума) = 1100.00;

Після першого року P = 1041.00;
Після другого року P = 1083.86;
Після третього року P = 1128.30;

Клієнту доведеться чекати 3 роки для отримання бажаної суми (1100).

Завдання: написати функцію getYears яка буде приймати 4 аргументи (p, i, t, d) (назви можна поміняти для зручності) яка буде повертати кількість років.

Тести:

getYears(1000, 0.05, 0.18, 1100) // 3
getYears(1000, 0.01625, 0.18, 1200) // 14
*/

function getYears(provision, interestRate, taxes, desirableAmount) {
    let years = 0;

    while(provision < desirableAmount) {
        provision += provision * interestRate * (1 - taxes)
        years += 1
    }
    
    return years;
}


getYears(1000, 0.05, 0.18, 1100)
getYears(1000, 0.01625, 0.18, 1200)