/*
Задача 4 - Черга в супермаркеті (складність 3/5)

Є певна черга в супермаркеті з можливістю самообслуговування. 
Завдання: написати функцію яка обраховує загальний час потрібний для того щоб обслужити всіх людей.
Функція приймає два аргументи
1. Покупці, масив додатніх чисел який означає кількість людей в черзі. Кожне число вказує на кількість часу необхідну для обслуговування одного покупця. 
2. Кількість кас, додатнє число.

Функція повинна повертати число, скільки часу в загальному потрібно.

Уточнення:
Є тільки одна черга.
Порядок черги ніколи не змінюється.
Припускаємо що перша людина підходить до каси як тільки вона звільняється.

Приклади:
queueTime([5,3,4], 1) - 3 покупці, для яких потрібно 5, 3 і 4 хвилини відповідно і 1 каса
Результат повинен бути 12 (так як 5 + 3 + 4 = 12)

queueTime([10, 2, 3, 3], 2) - 4 покупці, для яких потрібно 10, 2, 2 і 3 хвилини відповідно і 2 каси
Результат повинен бути 10.

queueTime([], 1); - немає покупців, 1 каса
Результат повинен бути 0

Тести:

queueTime([ 26, 42, 13, 18, 48, 38, 39, 25, 39, 6, 35, 11, 7, 38, 19, 14 ], 1) // 418

queueTime([ 34, 31, 40, 30, 48, 2, 19, 32, 37, 13, 30, 49, 3, 13, 12, 43, 39, 22, 47 ], 4) // 162

queueTime([ 19, 1, 27, 35, 16, 4, 45, 49, 41, 25 ], 5) // 65
*/

function queueTime(queue, cashbox)  {
    let result = [];

    for (let i = 0; i < cashbox; i++) {
        result.push(0)
    }

    queue.forEach(element => {
        const minValue = Math.min.apply(null, result)
        const index = result.indexOf(minValue);

        result[index] += element;
    });

    return Math.max.apply(null, result)
}


queueTime([10, 2, 3, 3], 2)